// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
// - створити функцію яка обчислює та повертає площу кола з радіусом r
// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
// - створити функцію яка приймає масив та виводить кожен його елемент
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію sum(arr)яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад sum([1,2,10]) //->13
// - створити функцію swap(arr,index1,index2). Функція міняє місцями заняення у відаовідних індексах
// Приклад  swap([11,22,33,44],0,1) //=> [22,11,33,44]
// - Написати функцію обміну валюти exchange(sumUAH,currencyValues,exchangeCurrency)
// Приклад exchange(10000,[{currency:'USD',value:40},{currency:'EUR',value:42}],'USD') // => 250

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б

// function area(a,b) {
//     return a*b;
// }
//
// console.log(area(10,5));

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - створити функцію яка обчислює та повертає площу кола з радіусом r

// function areaCircle(r) {
//     return Math.PI * r**2;
// }
//
// console.log(areaCircle(5));

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r

// function cilindr(r,h) {
//     return Math.round((2 * Math.PI * r * (r+h)));
// }
//
// console.log(cilindr(4,10));

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - створити функцію яка приймає масив та виводить кожен його елемент

// let users = [
//     {name: 'vasya', age: 31, status: false},
//     {name: 'petya', age: 30, status: true},
//     {name: 'kolya', age: 29, status: true},
//     {name: 'olya', age: 28, status: false},
//     {name: 'max', age: 30, status: true},
//     {name: 'anya', age: 31, status: false},
//     {name: 'oleg', age: 28, status: false},
//     {name: 'andrey', age: 29, status: true},
//     {name: 'masha', age: 30, status: true},
//     {name: 'olya', age: 31, status: false},
//     {name: 'max', age: 31, status: true}
// ];
//
// function xxx(array) {
//     for (const item of array) {
//         console.log(item);
//     }
// }
//
// xxx(users);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - створити функцію яка створює параграф з текстом. Текст задати через аргумент

// function paragph(argument, tag) {
//     document.write(`<${tag}> ${argument} </${tag}>`)
// }
//
// paragph('some text', 'h2');

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий

// function lizki(arg) {
//     document.write(`<ul>`);
//
//     document.write(`<li>${arg}</li>`);
//     document.write(`<li>${arg}</li>`);
//     document.write(`<li>${arg}</li>`);
//
//
//     document.write(`</ul>`);
// }
//
// lizki(`chinazes`);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)

// function lizhki(arg, number) {
//     document.write(`<ul>`);
//
//     for (let i = 0; i < number; i++) {
//         document.write(`<li> ${arg} </li>`);
//     }
//
//     document.write(`</ul>`);
// }
//
// lizhki(`some text`, 6);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список

// let arr = [123,41,true,'string', 34,false,'lolipop', 488];
//
// function xxx(array) {
//
//     document.write(`<ul>`);
//     for (const item of array) {
//         document.write(`<li>${item}</li>`);
//     }
//     document.write(`</ul>`);
// }
//
// xxx(arr);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.

// const mas = [
//     {id: 2845, name: 'Fransua', age: 23},
//     {id: 6792, name: 'Gloria', age: 78},
//     {id: 0932, name: 'Gektor', age: 12},
//     {id: 5924, name: 'Gustavo', age: 34},
//     {id: 7243, name: 'Sicasio', age: 27},
//     {id: 4298, name: 'Duveini', age: 37}
// ];
//
// function sortOfmas(arr) {
//     for (const user of arr) {
//         document.write(`<div> ${user.id} - ${user.name} - ${user.age}</div>`);
//     }
// }
//
// sortOfmas(mas);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - створити функцію яка повертає найменьше число з масиву

// const mas = [23,4546,67,3, 239,23,999,2,1,89];
//
// function xxx(array) {
//     let result = array[0];
//     for (let i = 1; i < array.length; i++) {
//         if (array[i] < array[0]){
//             result = array[i];
//         }
//     }
//     return result;
// }
//
// console.log(xxx(mas));

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - створити функцію sum(arr)яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад sum([1,2,10]) //->13
